In [1]:
# 1) pivot(), pd.pivot_table()
# 2) stack(), unstack()
# 3) melt()
# 4) wide_to_long()
# 5) pd.crosstab() 
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({"customer_id": ['kim', 'lee', 'park', 'song', 'yoon', 'kang', 'tak', 'ryu', 'jang'],
                           "product_code": ['com', 'phone', 'tv', 'com', 'phone', 'tv', 'com', 'phone', 'tv'],
                           "grade": ['A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B'],
                           "purchase_amount": [30, 10, 0, 40, 15, 30, 0, 0, 10]})

In [3]:
df

  customer_id product_code grade  purchase_amount
0         kim          com     A               30
1         lee        phone     A               10
2        park           tv     A                0
3        song          com     A               40
4        yoon        phone     A               15
5        kang           tv     A               30
6         tak          com     B                0
7         ryu        phone     B                0
8        jang           tv     B               10

In [5]:
mul_index = pd.MultiIndex.from_tuples([('cust_1', '2015'), ('cust_1', '2016'),('cust_2', '2015'), ('cust_2', '2016')])
data = pd.DataFrame(data=np.arange(16).reshape(4, 4),index=mul_index,columns=['prd_1', 'prd_2', 'prd_3', 'prd_4'])
data

             prd_1  prd_2  prd_3  prd_4
cust_1 2015      0      1      2      3
       2016      4      5      6      7
cust_2 2015      8      9     10     11
       2016     12     13     14     15

In [6]:
type(mul_index)

pandas.core.indexes.multi.MultiIndex

In [7]:
data.stack()

cust_1  2015  prd_1     0
              prd_2     1
              prd_3     2
              prd_4     3
        2016  prd_1     4
              prd_2     5
              prd_3     6
              prd_4     7
cust_2  2015  prd_1     8
              prd_2     9
              prd_3    10
              prd_4    11
        2016  prd_1    12
              prd_2    13
              prd_3    14
              prd_4    15
dtype: int32

In [8]:
data.stack().index

MultiIndex([('cust_1', '2015', 'prd_1'),
            ('cust_1', '2015', 'prd_2'),
            ('cust_1', '2015', 'prd_3'),
            ('cust_1', '2015', 'prd_4'),
            ('cust_1', '2016', 'prd_1'),
            ('cust_1', '2016', 'prd_2'),
            ('cust_1', '2016', 'prd_3'),
            ('cust_1', '2016', 'prd_4'),
            ('cust_2', '2015', 'prd_1'),
            ('cust_2', '2015', 'prd_2'),
            ('cust_2', '2015', 'prd_3'),
            ('cust_2', '2015', 'prd_4'),
            ('cust_2', '2016', 'prd_1'),
            ('cust_2', '2016', 'prd_2'),
            ('cust_2', '2016', 'prd_3'),
            ('cust_2', '2016', 'prd_4')],
           )

In [9]:
type(data.loc)

pandas.core.indexing._LocIndexer

In [10]:
type(data.iloc)

pandas.core.indexing._iLocIndexer

In [11]:
df = pd.DataFrame({"customer_id":['kim','lee','park','song','yoon','kang','tak','ryu','jang'],
               "product_code":['com','phone','tv','com','phone','tv','com','phone','tv'],
               "grade":['A','A','A','A','A','A','B','B','B'],
               "purchase_amount":[30,10,0,40,15,30,0,0,10]})

In [12]:
type(data.stack())

pandas.core.series.Series

In [13]:
type(df.stack())

pandas.core.series.Series

In [14]:
df

  customer_id product_code grade  purchase_amount
0         kim          com     A               30
1         lee        phone     A               10
2        park           tv     A                0
3        song          com     A               40
4        yoon        phone     A               15
5        kang           tv     A               30
6         tak          com     B                0
7         ryu        phone     B                0
8        jang           tv     B               10

In [15]:
df.stack()

0  customer_id          kim
   product_code         com
   grade                  A
   purchase_amount       30
1  customer_id          lee
   product_code       phone
   grade                  A
   purchase_amount       10
2  customer_id         park
   product_code          tv
   grade                  A
   purchase_amount        0
3  customer_id         song
   product_code         com
   grade                  A
   purchase_amount       40
4  customer_id         yoon
   product_code       phone
   grade                  A
   purchase_amount       15
5  customer_id         kang
   product_code          tv
   grade                  A
   purchase_amount       30
6  customer_id          tak
   product_code         com
   grade                  B
   purchase_amount        0
7  customer_id          ryu
   product_code       phone
   grade                  B
   purchase_amount        0
8  customer_id         jang
   product_code          tv
   grade                  B
   purchase_amount       10
dtype: object

In [16]:
df_1 = df.pivot(columns=['grade', 'customer_id'], index='product_code', values='purchase_amount')
df_2 = df.pivot(index=['grade', 'customer_id'], columns='product_code', values='purchase_amount')

In [17]:
df_1

grade            A                                 B
customer_id    kim   lee park  song  yoon  kang  tak  ryu  jang
product_code
com           30.0   NaN  NaN  40.0   NaN   NaN  0.0  NaN   NaN
phone          NaN  10.0  NaN   NaN  15.0   NaN  NaN  0.0   NaN
tv             NaN   NaN  0.0   NaN   NaN  30.0  NaN  NaN  10.0

In [18]:
df_2

product_code        com  phone    tv
grade customer_id
A     kang          NaN    NaN  30.0
      kim          30.0    NaN   NaN
      lee           NaN   10.0   NaN
      park          NaN    NaN   0.0
      song         40.0    NaN   NaN
      yoon          NaN   15.0   NaN
B     jang          NaN    NaN  10.0
      ryu           NaN    0.0   NaN
      tak           0.0    NaN   NaN

In [19]:
df_2.stack()

grade  customer_id  product_code
A      kang         tv              30.0
       kim          com             30.0
       lee          phone           10.0
       park         tv               0.0
       song         com             40.0
       yoon         phone           15.0
B      jang         tv              10.0
       ryu          phone            0.0
       tak          com              0.0
dtype: float64

In [20]:
type(df_2.stack())

pandas.core.series.Series

In [21]:
df_1.stack()

grade                        A     B
product_code customer_id
com          kim          30.0   NaN
             song         40.0   NaN
             tak           NaN   0.0
phone        lee          10.0   NaN
             ryu           NaN   0.0
             yoon         15.0   NaN
tv           jang          NaN  10.0
             kang         30.0   NaN
             park          0.0   NaN

In [22]:
type(df_1.stack())

pandas.core.frame.DataFrame

In [23]:
df_2.stack().index

MultiIndex([('A', 'kang',    'tv'),
            ('A',  'kim',   'com'),
            ('A',  'lee', 'phone'),
            ('A', 'park',    'tv'),
            ('A', 'song',   'com'),
            ('A', 'yoon', 'phone'),
            ('B', 'jang',    'tv'),
            ('B',  'ryu', 'phone'),
            ('B',  'tak',   'com')],
           names=['grade', 'customer_id', 'product_code'])

In [24]:
df_2.stack().index.info

AttributeError: 'MultiIndex' object has no attribute 'info'

In [25]:
len(df_2.stack().index)

9

In [26]:
df_2.stack().index[0]

('A', 'kang', 'tv')

In [27]:
df_2.stack().index[9]

IndexError: index 9 is out of bounds for axis 0 with size 9

In [28]:
df_2.stack().index[8]

('B', 'tak', 'com')

In [29]:
df_2.stack().index[1][0]

'A'

In [30]:
df_2_stacked = df_2.stack()

In [31]:
type(df_2_stacked)
df_2_stacked.unstack()

product_code        com  phone    tv
grade customer_id
A     kang          NaN    NaN  30.0
      kim          30.0    NaN   NaN
      lee           NaN   10.0   NaN
      park          NaN    NaN   0.0
      song         40.0    NaN   NaN
      yoon          NaN   15.0   NaN
B     jang          NaN    NaN  10.0
      ryu           NaN    0.0   NaN
      tak           0.0    NaN   NaN

In [32]:
type(df_2_stacked.unstack())

pandas.core.frame.DataFrame

In [33]:
df_t_o = pd.DataFrame(np.arange(16).reshape(4,4),
                index = pd.MultiIndex.from_tuples([('kim','2019'),('kim','2020'),('lee','2019'),('lee','2020')]),
                columns = ['com','phone','tv','notebook'])
df_t_1 = df_t_0.stack(level=-1, dropna=True)
df_t_2 = df_t_1.unstack(level=0)
df_t_3 = df_t_2.reset_index()
df_t_4 = df_t_3.rename(columns={'level_0':'customer_id','level_1':'year'}, inplace=True)

NameError: name 'df_t_0' is not defined

In [34]:
df_t_o = pd.DataFrame(np.arange(16).reshape(4,4),
                index = pd.MultiIndex.from_tuples([('kim','2019'),('kim','2020'),('lee','2019'),('lee','2020')]),
                columns = ['com','phone','tv','notebook'])
df_t_1 = df_t_o.stack(level=-1, dropna=True)
df_t_2 = df_t_1.unstack(level=0)
df_t_3 = df_t_2.reset_index()
df_t_4 = df_t_3.rename(columns={'level_0':'customer_id','level_1':'year'}, inplace=True)

In [35]:
df_t_o

          com  phone  tv  notebook
kim 2019    0      1   2         3
    2020    4      5   6         7
lee 2019    8      9  10        11
    2020   12     13  14        15

In [36]:
df_t_1

kim  2019  com          0
           phone        1
           tv           2
           notebook     3
     2020  com          4
           phone        5
           tv           6
           notebook     7
lee  2019  com          8
           phone        9
           tv          10
           notebook    11
     2020  com         12
           phone       13
           tv          14
           notebook    15
dtype: int32

In [37]:
df_t_2

               kim  lee
2019 com         0    8
     phone       1    9
     tv          2   10
     notebook    3   11
2020 com         4   12
     phone       5   13
     tv          6   14
     notebook    7   15

In [38]:
df_t_3

  customer_id      year  kim  lee
0        2019       com    0    8
1        2019     phone    1    9
2        2019        tv    2   10
3        2019  notebook    3   11
4        2020       com    4   12
5        2020     phone    5   13
6        2020        tv    6   14
7        2020  notebook    7   15

In [39]:
df_t__4

NameError: name 'df_t__4' is not defined

In [42]:
df_t_3.rename(columns={'level_0':'customer_id','level_1':'year'}, inplace=True)

In [43]:
df_t_3 = df_t_2.reset_index()

In [44]:
df_t_3

  level_0   level_1  kim  lee
0    2019       com    0    8
1    2019     phone    1    9
2    2019        tv    2   10
3    2019  notebook    3   11
4    2020       com    4   12
5    2020     phone    5   13
6    2020        tv    6   14
7    2020  notebook    7   15

In [45]:
df_t_3.rename(columns={'level_0':'customer_id','level_1':'year'}, inplace=True)

In [46]:
df_t_3

  customer_id      year  kim  lee
0        2019       com    0    8
1        2019     phone    1    9
2        2019        tv    2   10
3        2019  notebook    3   11
4        2020       com    4   12
5        2020     phone    5   13
6        2020        tv    6   14
7        2020  notebook    7   15

In [48]:
frozen_data = pd.DataFrame({'cust_ID' : ['C_001', 'C_001', 'C_002', 'C_002'], 'prd_CD' : ['P_001', 'P_002', 'P_001', 'P_002'], 'pch_cnt' : [1, 2, 3, 4], 'pch_amt' : [100, 200, 300, 400]})

In [49]:
pd.melt(frozen_data, id_vars=['cust_ID', 'prd_CD'])

  cust_ID prd_CD variable  value
0   C_001  P_001  pch_cnt      1
1   C_001  P_002  pch_cnt      2
2   C_002  P_001  pch_cnt      3
3   C_002  P_002  pch_cnt      4
4   C_001  P_001  pch_amt    100
5   C_001  P_002  pch_amt    200
6   C_002  P_001  pch_amt    300
7   C_002  P_002  pch_amt    400

In [50]:
frozen_data(id_vars=['cust_ID', 'prd_CD'])

TypeError: 'DataFrame' object is not callable

In [51]:
frozen_data.melt(id_vars=['cust_ID', 'prd_CD'])

  cust_ID prd_CD variable  value
0   C_001  P_001  pch_cnt      1
1   C_001  P_002  pch_cnt      2
2   C_002  P_001  pch_cnt      3
3   C_002  P_002  pch_cnt      4
4   C_001  P_001  pch_amt    100
5   C_001  P_002  pch_amt    200
6   C_002  P_001  pch_amt    300
7   C_002  P_002  pch_amt    400

In [52]:
melted_data = frozen_data.melt(id_vars=['cust_ID', 'prd_CD'])

In [53]:
frozen_data

  cust_ID prd_CD  pch_cnt  pch_amt
0   C_001  P_001        1      100
1   C_001  P_002        2      200
2   C_002  P_001        3      300
3   C_002  P_002        4      400

In [54]:
melted_data

  cust_ID prd_CD variable  value
0   C_001  P_001  pch_cnt      1
1   C_001  P_002  pch_cnt      2
2   C_002  P_001  pch_cnt      3
3   C_002  P_002  pch_cnt      4
4   C_001  P_001  pch_amt    100
5   C_001  P_002  pch_amt    200
6   C_002  P_001  pch_amt    300
7   C_002  P_002  pch_amt    400

In [55]:
wide_data = pd.DataFrame({"C1prd1" : {0 : "a", 1 : "b", 2 : "c"}, "C1prd2" : {0 : "d", 1 : "e", 2 : "f"}, "C2prd1" : {0 : 2.5, 1 : 1.2, 2 : .7}, "C2prd2" : {0 : 3.2, 1 : 1.3, 2 : .1}, "value" : dict(zip(range(3), np.random.randn(3)))})

In [56]:
wide_data

  C1prd1 C1prd2  C2prd1  C2prd2     value
0      a      d     2.5     3.2 -2.000207
1      b      e     1.2     1.3  0.723690
2      c      f     0.7     0.1 -0.772448

In [57]:
seq_no = wide_data.index

In [58]:
wide_data.wide_to_long(["C1", "C2"], i="seq_no", j="prd")

AttributeError: 'DataFrame' object has no attribute 'wide_to_long'

In [59]:
pd.wide_to_long(wide_data, ["C1", "C2"], i="seq_no", j="prd")

KeyError: "None of [Index(['seq_no'], dtype='object')] are in the [columns]"

In [60]:
pd.wide_to_long(wide_data, ["C1", "C2"])

TypeError: wide_to_long() missing 2 required positional arguments: 'i' and 'j'

In [61]:
wide_data['id'] = wide_data.index

In [62]:
wide_data

  C1prd1 C1prd2  C2prd1  C2prd2     value  id
0      a      d     2.5     3.2 -2.000207   0
1      b      e     1.2     1.3  0.723690   1
2      c      f     0.7     0.1 -0.772448   2

In [63]:
pd.wide_to_long(wide_data, ["C1", "C2"], i='id', j='prd_number')

Empty DataFrame
Columns: [C1prd2, C2prd2, C2prd1, C1prd1, value, C1, C2]
Index: []

In [64]:
pd.wide_to_long(wide_data, ["C1", "C2"], i='id', j='prd_number', suffix='\D+\d+')

                  value C1   C2
id prd_number
0  prd1       -2.000207  a  2.5
1  prd1        0.723690  b  1.2
2  prd1       -0.772448  c  0.7
0  prd2       -2.000207  d  3.2
1  prd2        0.723690  e  1.3
2  prd2       -0.772448  f  0.1

In [65]:
data = pd.DataFrame({'id': ['id1', 'id1', 'id1', 'id2', 'id2', 'id3'], 'fac_1': ['a', 'a', 'a', 'b', 'b', 'b'], 'fac_2': ['d', 'd', 'd', 'c', 'c', 'd']})

In [67]:
wide_data_trial = pd.DataFrame({"C1prd1" : {0 : "a", 1 : "b", 2 : "c", 3: "g"}, "C1prd2" : {0 : "d", 1 : "e", 2 : "f", 3: "h"}, "C2prd1" : {0 : 2.5, 1 : 1.2, 2 : .7, 3: .9}, "C2prd2" : {0 : 3.2, 1 : 1.3, 2 : .1, 3: .4}, "value" : dict(zip(range(4), np.random.randn(3))), "seq" : dict(zip(range(4),list('abca')))})

In [68]:
wide_data_trial

  C1prd1 C1prd2  C2prd1  C2prd2     value seq
0      a      d     2.5     3.2 -0.714815   a
1      b      e     1.2     1.3 -0.551175   b
2      c      f     0.7     0.1 -0.531455   c
3      g      h     0.9     0.4       NaN   a

In [69]:
pd.wide_to_long(wide_data_trial, ['C1', 'C2'], i='seq', j='prd_number', suffix='\D+\d+')

ValueError: the id variables need to uniquely identify each row

In [70]:
wide_data_trial = pd.DataFrame({"C1prd1" : {0 : "a", 1 : "b", 2 : "c", 3: "g"}, "C1prd2" : {0 : "d", 1 : "e", 2 : "f", 3: "h"}, "C2prd1" : {0 : 2.5, 1 : 1.2, 2 : .7, 3: .9}, "C2prd2" : {0 : 3.2, 1 : 1.3, 2 : .1, 3: .4}, "value" : dict(zip(range(4), np.random.randn(4))), "seq" : dict(zip(range(4),list('abca')))})

In [71]:
wide_data_trial

  C1prd1 C1prd2  C2prd1  C2prd2     value seq
0      a      d     2.5     3.2 -2.500972   a
1      b      e     1.2     1.3  0.548999   b
2      c      f     0.7     0.1 -0.749879   c
3      g      h     0.9     0.4 -0.758223   a

In [72]:
pd.wide_to_long(wide_data_trial, ['C1', 'C2'], i='seq', j='prd_number', suffix='\D+\d+')

ValueError: the id variables need to uniquely identify each row